{"ids":["10925588825","10925192712","10925178717","10919412235","10903056519","10898448421","10887863933","10853164695","10853096112","10833152680","10818289051","10781113649","10778744192","10758775410","10733221434","10705955911","10691324047","10676223589","10671707796","10654804291","10621169777","10620749362","10596905788","10590267384","10585043266","10583723660","10581811916","10579303329","10549764817","10499289786","10475197129","10459944123","10449417911","10431111777","10404529077","10404359229","10399298696","10392511648","10377522528","10368895476","10359668813","10349169213","10338686595","10335423425","10295703057","10281868220","10281646421","10277066145","10274681209","10220981050"],"records":[{"author":"parada31","time":"2024-02-10T19:29:54-07:00","id":"10925588825","rating":"5","title":"Amazing App for Group Dinners","content":"Amazing app, makes it very simple and easy to split the bill and has some neat stuff added on! \n\nHoping for the Venmo connection to be fixed soon!"},{"author":"leslietualla","time":"2024-02-10T16:43:18-07:00","id":"10925192712","rating":"5","title":"Reliable & Easy","content":"This app has takes away the hassle of having to split bills. So easy to use."},{"author":"Maddkell","time":"2024-02-10T16:37:16-07:00","id":"10925178717","rating":"5","title":"Lifesaver","content":"Highly recommend!!"},{"author":"ALoveKing","time":"2024-02-09T04:35:17-07:00","id":"10919412235","rating":"4","title":"USD only??","content":"If there is a way to switch currencies, it’s not obvious to me. Would be great to have this included in an update. Otherwise I love the ease and conscience of this app!"},{"author":"Rueben Dorado","time":"2024-02-04T19:08:28-07:00","id":"10903056519","rating":"5","title":"It’s great","content":"This app makes it so easy for me to split bills for restaurants to grocery bills it is a very convenient tool for me"},{"author":"The Alt Vault","time":"2024-02-03T14:41:35-07:00","id":"10898448421","rating":"4","title":"Broken Venmo Connection - Still Great","content":"Amazing app that I have loved for years BUT it has never connected to Venmo. I would seriously love for that to be fixed and for another integration to be added with Splitwise- that would be amazing"},{"author":"Abhyurocks","time":"2024-02-01T00:39:49-07:00","id":"10887863933","rating":"5","title":"Everyone needs this app","content":"It’s freaking amazing"},{"author":"hilsaeveline","time":"2024-01-22T17:46:19-07:00","id":"10853164695","rating":"3","title":"Venmo won’t connect","content":"Great for the most part, except Venmo won’t connect to the app. It just leads me to a blank screen with two circles and two buttons, but clicking the “allow” button doesn’t do anything."},{"author":"CynthiaCar","time":"2024-01-22T17:18:47-07:00","id":"10853096112","rating":"2","title":"could be better","content":"i might need to find a better app for this sorta thing. the auto complete from a photo is suuuuper hit or miss. mostly misses if i’m honest to where it’s easier to manually enter it in. even then. at the end i can’t change the tax amount on my own which is annoying. it also doesn’t make it easy to split the tip evenly. it splits the tip based of percentage per amount spend which is fine… if i wanted to do that."},{"author":"anonymous honest review","time":"2024-01-17T11:17:37-07:00","id":"10833152680","rating":"2","title":"Venmo never connects","content":"Ever since I downloaded the app, it keeps telling me that venmo is “temporarily” not available. Temporarily in this case means always. If you can’t make it work, why are you setting the expectations that there is a possibility to connect to venmo?"},{"author":"Romance_geek","time":"2024-01-13T11:21:46-07:00","id":"10818289051","rating":"5","title":"Best App","content":"I use the app frequently with friends and it never fails!"},{"author":"Jaymenaomi","time":"2024-01-03T18:09:47-07:00","id":"10781113649","rating":"5","title":"Love it!! So helpful!","content":"I have used this app for over 10 yrs and I absolutely love it. My friends always tell me to use it when we go out and it makes life so much easier. Thank you! Thank you! Thank you!"},{"author":"Tab-restaurant tax rate","time":"2024-01-03T05:13:06-07:00","id":"10778744192","rating":"5","title":"Is there a setting to change the tax rate?","content":"I don’t think tax is always 18% it could vary."},{"author":"Tab NL","time":"2023-12-29T05:44:29-07:00","id":"10758775410","rating":"3","title":"Needs work","content":"When I take a picture, it’s not accurate"},{"author":"Innocent Sin","time":"2023-12-22T17:43:07-07:00","id":"10733221434","rating":"3","title":"Great but one issue never fixed","content":"Love the app. It makes splitting receipts  quick and easy. however, I have this issue with the short character limit for names, and another issue is that if the app gets the name of an item wrong on the receipt, it doesn’t allow me to change it for some reason I’m not able to delete any of the characters to fix the name. I’ve had this problem for the longest time, but they’ve never seem to fix it"},{"author":"Blaxa","time":"2023-12-16T20:35:01-07:00","id":"10705955911","rating":"4","title":"Where has this app been?","content":"We just tried this today to split a bill for 12 people among 4 people. Everyone was impressed! Love that this really solves an everyday kind of situation! However, it mentioned an \"unclaimed amount\" and we had no way to easily see which item it was so I just ate up that cost. Also, I couldn't see a way to see the capture of the actual bill to confirm some things."},{"author":"Mcnuggs","time":"2023-12-13T14:22:55-07:00","id":"10691324047","rating":"5","title":"Awesome!","content":"Wish this app was around back when I was younger and went out in large groups.  Super convenient!"},{"author":"claudbdnd","time":"2023-12-09T15:38:31-07:00","id":"10676223589","rating":"5","title":"Easy to use!","content":"Súper user friendly perfect for splitting checks. Always recommend to everyone I know"},{"author":"jamaicaj","time":"2023-12-08T13:16:48-07:00","id":"10671707796","rating":"2","title":"Could be cool","content":"I’ve experimented with this app a couple of times now and used a very simple receipt and the app struggled hard to identify the correct items and amounts. \n\nI’ve also not been able to connect my Venmo account and have reached out to the devs via email multiple times now and they have not responded at all."},{"author":"ZenthicBeta","time":"2023-12-03T17:04:11-07:00","id":"10654804291","rating":"1","title":"Venmo doesn’t work","content":"The whole reason I downloaded this app is because it advertised simple Venmo support so I wouldn’t have to manually request everyone. However this option still does not work after months and there seems to be no motivation to make it work."},{"author":"iPatxx","time":"2023-11-24T12:58:38-07:00","id":"10621169777","rating":"1","title":"Inability to manually change tax amount.","content":"Incorrect tax amount without the ability to change it. My receipt lists tax as $1.54 but the app keeps trying to charge $4.62. There’s no way to manually change it either, just the tip amount."},{"author":"KezG.","time":"2023-11-24T10:26:09-07:00","id":"10620749362","rating":"4","title":"Looking for something like this","content":"I do bulk grocery shopping with friends and family. Im looking for an easy way to snap a picture of bill , select who’s expense and it tally up the cost.\nThis is almost what I need but geared more towards splitting restaurant bills.\nIt would be nice if there was an option to select what type of bill you want to split and also  if the members /names can be saved. Overall a great concept and easy to use"},{"author":"Omarblu","time":"2023-11-17T19:02:09-07:00","id":"10596905788","rating":"2","title":"Needs work","content":"Love the concept of the app but it always gets confused when adding the subtotals and tips. It’ll have a random crazy price that’s no where near what we your bill is. It should allow us to manually make changes to the taxes and tips portion of the bill"},{"author":"claire_1239399","time":"2023-11-15T20:27:44-07:00","id":"10590267384","rating":"3","title":"Wish venmo integration worked","content":"Would be perfect if that happened!"},{"author":"Musichameleon","time":"2023-11-14T07:31:18-07:00","id":"10585043266","rating":"5","title":"Simple app! A must for anybody under the age of 40!","content":"Easy to use interface, and somehow now makes picking up the tab, and dividing later, not an enormous chore."},{"author":"MichallaGeer","time":"2023-11-13T22:19:33-07:00","id":"10583723660","rating":"5","title":"Honestly great for a free app","content":"For being free, this app is great. Sure, it has its quirks. I put my hand/napkin over anything on the receipt that shouldn’t be in the picture. I also don’t use the Venmo integration. But it is so easy to split items and quickly tell who owes what. Very impressed, use it all the time."},{"author":"Dariusssssssss1","time":"2023-11-13T08:10:03-07:00","id":"10581811916","rating":"5","title":"This app is awesome","content":"Love the app!! Overall a 4.9/5 for me, there were certain parts of the process that weren’t so obvious at first but could easily be figured out by revisiting. For example, The item assignment for claiming bill items. Upon arriving at the final page to pay, I realized items were unclaimed as it wasn’t entirely obvious in the moment. Finding a way to make it obvious the first iteration would be awesome, but that’s a difficult design question.\n\nOther aspects were related to the Venmo integration having issues, but that’s prob just a backend integration issue."},{"author":"joeenguyenn","time":"2023-11-12T14:01:18-07:00","id":"10579303329","rating":"2","title":"Potential but not good enough","content":"This could’ve been the best app ever but the fact that you take the subtotal before tax and add the tip percentage and THEN you add tax is stupid. the tax should be before the tip."},{"author":"Joao1405","time":"2023-11-04T09:36:53-07:00","id":"10549764817","rating":"2","title":"Photo gallery issues","content":"Great interface and easy to navigate, but there are serious issues with pulling a receipt photo from your gallery and reading it."},{"author":"jschwartz830","time":"2023-10-21T06:12:55-07:00","id":"10499289786","rating":"5","title":"Works well","content":"Intuitive interface. Great for splitting bills."},{"author":"tylerfire55","time":"2023-10-14T15:09:28-07:00","id":"10475197129","rating":"3","title":"Please Fix Integration!","content":"The app is great. I haven't had any issues with adding amounts or food items, and it seems very intuitive most of the time too, but we need the Venmo integration back ASAP!"},{"author":"Jobieg2012","time":"2023-10-10T10:50:05-07:00","id":"10459944123","rating":"5","title":"Downloaded this not knowing it would be a true game changer!!","content":"This app is very easy to use once you understand what clicking on certain things does. It made splitting a large bill with family so super easy! I am obsessed. Will be sharing with friends and family from now on. Working in restaurant industry has made me really appreciate how this functions."},{"author":"Flowingrace","time":"2023-10-07T10:21:50-07:00","id":"10449417911","rating":"5","title":"Better than all other bill splitting apps","content":"I recently was asked to try Plates when I was out with a party of 13. The app is pretty, but when it comes to functionality and splitting checks, Tab is the best. Take a photo and it will automatically note all of the dishes and $$. I love that you can add people to the bill, not just random plates (looking at you Plates). Would highly recommend Tab to anyone going out with large parties where you need to split the check 😎"},{"author":"Jadricj","time":"2023-10-02T09:16:03-07:00","id":"10431111777","rating":"2","title":"Taxes","content":"I’m not able to add the taxes"},{"author":"Rosentrotter","time":"2023-09-24T21:42:04-07:00","id":"10404529077","rating":"5","title":"This app is a must have","content":"Rarely do I write reviews. This app has likely saved me money (of me missing a few dollars/cents trying to figure out this math on my own) and so many headaches splitting bills of large groups at restaurants that do not want to take the time to do separate checks. \n\nOver time, I have actually found it easier to just use this app rather than asking the server to do separate checks. In my experience with Tab, if you’re willing to do the work of figuring out who got what yourself, your servers get the order right, your food comes quicker (since they don’t have to spend a long time at the computer typing everything in carefully), and it makes the experience for the group better as a whole. \n\nA few feature suggestions:\n\nAppetizers: A conversation that tends to come up when deciding who got what is “well this person are more of this than this person.” Can you create a way to say “this person had 4 of 12 items from this” instead of splitting it 12 ways and tapping it four times? Technically the app does this, but it requires a bit of extra taps. \n\nAlcohol: Guests may feel it’s appropriate to tip more for elaborate cocktails than they would for a pizza. Servers also tip out the bartender. Is there a way to figure out how to skew tips up based on how much of the bill was alcohol? For example, 15% for the food, 20% for the alcohol."},{"author":"Kenz123454321","time":"2023-09-24T20:13:35-07:00","id":"10404359229","rating":"5","title":"THIS IS EXACTLY WHAT I NEEDED!!","content":"So so so cool!!! So useful and everyone needs this! Put the bill on one persons card and EASILY Venmo the exact amount of your meal!"},{"author":"th3druminator","time":"2023-09-23T10:06:30-07:00","id":"10399298696","rating":"2","title":"Used to be great","content":"I love tab but it no longer works with Venmo so it’s not as useful as it used to be."},{"author":"hoobla","time":"2023-09-21T12:02:06-07:00","id":"10392511648","rating":"1","title":"Does not work","content":"Adding incorrectly, total always wrong"},{"author":"Shar therapies","time":"2023-09-17T04:40:03-07:00","id":"10377522528","rating":"2","title":"Venmo Connection No Good","content":"The Venmo connection options doesn’t work"},{"author":"Ordered wings","time":"2023-09-14T16:36:46-07:00","id":"10368895476","rating":"5","title":"Perfect","content":"Does exactly what it needs to do quickly"},{"author":"Bevsastar","time":"2023-09-11T22:23:28-07:00","id":"10359668813","rating":"5","title":"Amazing! And perfect for big parties!!","content":"Love!"},{"author":"kjc9three","time":"2023-09-08T22:30:05-07:00","id":"10349169213","rating":"3","title":"Meh","content":"Would be better if you could enter the tax in manually. Would often times get the numbers wrong when uploading a bill"},{"author":"NippleLion","time":"2023-09-05T20:35:09-07:00","id":"10338686595","rating":"5","title":"Perfect","content":"Works great! But I would say that the tip should be easier to change. Maybe like a dial? Sometimes the photo doesn’t capture all the elements but it’s easy to edit. Thanks for this app!"},{"author":"ploddingonby","time":"2023-09-04T21:19:11-07:00","id":"10335423425","rating":"1","title":"Doesn’t work as advertised","content":"The venmo integration doesn’t work"},{"author":"Sarder23","time":"2023-08-24T16:16:03-07:00","id":"10295703057","rating":"5","title":"Amazing! Absolutely great when going out with friends!","content":"Save us so much time with the bill, I just wish they would incorporate Zelle in the request and send like they do with Venmo"},{"author":"Domini123","time":"2023-08-20T20:27:43-07:00","id":"10281868220","rating":"5","title":"Helpful app for splitting the bill","content":"Really useful to calculate everyone’s total including tip and taxes"},{"author":"CrimeObssessedAsf","time":"2023-08-20T18:53:17-07:00","id":"10281646421","rating":"1","title":"Can’t even connect to Venmo","content":"What good is an app if the features aren’t fully functional?"},{"author":"kyawzazaw","time":"2023-08-19T12:04:48-07:00","id":"10277066145","rating":"5","title":"Great app","content":"Can you make it so that certain items can be split?"},{"author":"Vasu2021","time":"2023-08-18T21:27:53-07:00","id":"10274681209","rating":"2","title":"Need to do the math","content":"Just came from a dinner with friends. I realized the software didn’t pickup the tax and tip clearly mentioned in the bill. I ended up paying the tax and tip for 8 people!"},{"author":"picklesssssssssss","time":"2023-08-04T20:24:15-07:00","id":"10220981050","rating":"5","title":"My go to for settling tabs","content":"It does all the things I want it to do!"}],"mostRecent":"2024-02-10T19:29:54-07:00"}